### Merge Using A Dataframge Column

In [1]:
import pandas as pd 
df1 = pd.DataFrame({
    'city':['new york','chicago','orlando'],
    'temperature': [21,14,35]
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [2]:
df2 = pd.DataFrame({
    'city': ['chicago','new york','orlando','california'],
    'humidity': [65,68,75,56]
})

df2

         city  humidity
0     chicago        65
1    new york        68
2     orlando        75
3  california        56

In [3]:
df3 = pd.merge(df1,df2,on='city')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### Types Of DataBase Joins

In [4]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [5]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [6]:
df3 = pd.merge(df1,df2,on='city',how='inner') # only all-known values cities
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [8]:
df3 = pd.merge(df1,df2,on='city', how='outer') # all cities 
df3

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [9]:
df3 = pd.merge(df1,df2,on='city',how='left') # all cities in the left data frame
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [10]:
df3 = pd.merge(df1,df2,on='city',how='right') # all cities in the right data frame
df3

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

In [11]:
df3 = pd.merge(df1,df2,on='city',how='outer',indicator = True)
df3 # indicates in which data frame the city is

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only

### Suffixes

In [12]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [13]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [14]:
df3 = pd.merge(df1,df2,on='city',how='outer',suffixes = ('_first','_second'))
df3

,city,temperature_first,humidity_first,temperature_second,humidity_second
0,new york,21.0,65.0,14.0,68.0
1,chicago,14.0,68.0,21.0,65.0
2,orlando,35.0,71.0,NaN,NaN
3,baltimore,38.0,75.0,NaN,NaN
4,san diego,NaN,NaN,35.0,71.0

In [15]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   city                5 non-null      object
 1   temperature_first   4 non-null      float64
 2   humidity_first      4 non-null      float64
 3   temperature_second  3 non-null      float64
 4   humidity_second     3 non-null      float64
dtypes: float64(4), object(1)
memory usage: 240.0+ bytes

In [16]:
df3.describe()

       temperature_first  humidity_first  temperature_second  humidity_second
count           4.000000        4.000000            3.000000              3.0
mean           27.000000       69.750000           23.333333             68.0
std            11.401754        4.272002           10.692677              3.0
min            14.000000       65.000000           14.000000             65.0
25%            19.250000       67.250000           17.500000             66.5
50%            28.000000       69.500000           21.000000             68.0
75%            35.750000       72.000000           28.000000             69.5
max            38.000000       75.000000           35.000000             71.0

### Join

In [17]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [18]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [19]:
df1.join(df2) # must be stored in a new data frame for future editing

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75